package telegram;

public class Data {
    static final String ARTICLE = "ЛИЧНЫЕ ГРАНИЦЫ. Как защитить себя от психологической оккупации?\n" +
            "\n" +
            " \n" +
            "\n" +
            "Сегодня предлагаю вам поговорить о границах. Но не о государственных или территориальных, а о психологических — границах личности. Что это такое, для чего они нужны и как понять, где находятся собственные психологические границы?\n" +
            "Одна из основных характеристик зрелой личности - осознание своих границ. Когда мы понимаем, где Я, а где Другой, гораздо легче и эффективнее выстраиваются отношения, успешнее регулируются собственные эмоции и растет уверенность в себе. \n" +
            "\n" +
            "ЕСЛИ ЧЕЛОВЕК:\n" +
            "- не знает, чего он хочет;\n" +
            "- часто обижается на других;\n" +
            "- затрудняется принимать решения и делать выбор, ему нужны советы и одобрение со стороны;\n" +
            "- наоборот, легко принимает решения, в том числе и за других, желая им помочь;\n" +
            "- частенько чувствует вину перед другими людьми;\n" +
            "- испытывает в отношениях с близкими сильные противоречивые эмоции (например, то любит, то ненавидит); \n" +
            "- не умеет ясно выражать свои желания, чувства;\n" +
            "\n" +
            "- не умеет отказывать Другим;\n" +
            "- затрудняется отстаивать свои права,\n" +
            "то, похоже, что у него есть сложности с пониманием и защитой своих личностных границ.\n" +
            "\n" +
            " \n" +
            "\n" +
            "Граница — это некоторая черта, отделяющая одно от другого.\n" +
            "\n" +
            "В случае с психологическими границами, эта условная черта между моим внутренним миром и внутренним миром другого человека. Это черта между так называемыми психологическими территориями разных людей. Что может входить в психологическую территорию?\n" +
            "\n" +
            "Мои ценности, желания (и не-желания), предпочтения (профессиональные, стиля жизни, увлечений, в еде и пр.), принимаемые решения (или, кстати, нежелание принимать решение), представления о себе (своих качествах, возможностях и месте в мире) и о других людях, а также вещи, которые я считаю своими, — это всё «моя психологическая территория».\n" +
            "\n" +
            "Человеку свойственно свою территорию защищать, и не всех туда пускать.\n" +
            "\n" +
            "Свои психологические границы мы осознаем тогда, когда кто-то пытается их нарушить. Вот, что вы чувствуете, если кто-то говорит о вашей любимой работе «Ну и ерундой ты занимаешься!»? Вряд ли радость. Скорее всего, это будет либо ощущение протеста, злости и возмущения, либо стыд, тревога, чувство самоуничижения и вины...\n" +
            "\n" +
            "А что скажете в ответ? Будете оправдываться? Или подумаете: «Возможно, и в самом деле, надо бы сменить работу». Или ответите что-то типа: «А у тебя, можно подумать, работа лучше?!» Или: «Мне наплевать на твое мнение, мне моя работа нравится!» А, может быть, так: «Мне неприятно, когда ты так говоришь. Мне моя работа нравится.» На Ваш взгляд, какой из приведенных вариантов ответа защищает границы?..\n" +
            "\n" +
            "Защита границ предполагает, в первую очередь, уверенность в том, что мы собираемся защищать. Когда мы сами себя не знаем и не понимаем, то наши границы легко проницаемы... Когда же я четко знаю, что, например, эта работа — мой осознанный выбор, она приносит мне удовольствие и удовлетворение (а не сомнения и терзания), то как я буду реагировать на оценку со стороны? Достаточно спокойно.\n" +
            "\n" +
            "Как правило, первые попытки защиты границ достаточно агрессивны и бескомпромиссны. Яркий пример — реакция подростка на негативную оценку его предпочтений (и, на самом деле, это хорошо, когда подросток реагирует таким образом. Гораздо печальнее, когда он/она не предпринимает никаких попыток защиты своих границ).\n" +
            "\n" +
            "Умение выстраивать границы закладывается в детстве и развивается по мере взросления. Правда, только в том случае, если родители уважают «отдельность» ребенка. Если ребенку с раннего детства предоставляется выбор (конечно, соответственно возрасту, по мере растущей возможности его делать), уважаются его решения, интересы и предпочтения, то с формированием границ обычно сложностей не возникает.\n" +
            "\n" +
            "Если же, наоборот, родители всегда «знают, что для их ребенка лучше», сильно контролируют или чрезмерно опекают, ребенок вырастает во взрослого, толком не знающего себя и не умеющего защищать свои границы.\n" +
            "\n" +
            " \n" +
            "\n" +
            "Своеобразным индикатором умения отстаивать свои границы является умение сказать «НЕТ». Так, известный американский психолог Мерилин Мюррей предложила пять способов сказать «да» и «нет», разделяя их на здоровое/нездоровое «да» и «нет».\n" +
            "\n" +
            "1. Ты просишь меня о чём-то, мне это нравится, и я говорю «Да».\n" +
            "\n" +
            "2. Ты просишь меня о чём-то, мне это не нравится и я говорю «Да», но возмущаюсь/обижаюсь при этом.\n" +
            "\n" +
            "3. Ты просишь меня о чём-то, мне это не нравится и я говорю «Нет» и нормально отношусь к этому.\n" +
            "\n" +
            "4. Ты просишь меня о чём-то, мне это не нравится и я говорю «Нет» и чувствую себя очень виноватым/виноватой.\n" +
            "\n" +
            "5. Ты просишь меня о чём-то, мне это не нравится, но, поскольку я отношусь к тебе с любовью и заботой, то я говорю «Да» и не возмущаюсь/не обижаюсь при этом.\n" +
            "\n" +
            " \n" +
            "\n" +
            "Люди, которые не умеют заботиться о том, чтобы устанавливатьсобственные психологические границы, обычно реагируют 2-м и 4-м способами.\n" +
            "\n" +
            "5й способ имеет некоторый подвох. Если это действительно так (т. е. «Мне это не нравится, но я соглашаюсь из-за любви к тебе и не обижаюсь»), то как долго может просуществовать такая ситуация?\n" +
            "\n" +
            "Этот ответ может считаться здоровым как временная реакция, при наличии взаимности со стороны партнера, но не как односторонняя стратегия. Потому что делать то, что нам не нравится, в течение долгого времени и не испытывать при этом негативных эмоций — невозможно. Соответственно, следующим шагом будет пункт 2, а потом (в норме) 3.\n" +
            "\n" +
            " \n" +
            "\n" +
            "Понимание собственного внутреннего мира и выстраивание границ с миром других людей — путь к личностной зрелости. Сделать этот путь короче и легче может помощь и поддержка психологов. " + "\n" +
            "Автор статьи- Юлия Бочкарева\n" +
            "\n" ;
}
