package telegram;

public class Data {
    static final String ARTICLE_FIRST = "\n" + "Как перестать обижаться на партнера? Почему мы не уходим из отношений, которые нас не удовлетворяют? Почему нельзя забывать о друзьях из-за влюбленности?\n" +
            "\n" +
            "О взаимной отдаче в отношениях\n" +
            "Если вы с девушкой гуляете, то надо понимать, что вы это делаете для себя. Она вам нравится, вам хорошо проводить время вместе, это конец рассказа. Как вести себя дальше — это уже ее дело, ваше дело гулять. Почему вы считаете, что это несправедливо, если она понятия не имела, что должно быть что-то после?\n" +
            "\n" +
            "Можно иначе поставить вопрос: если вы себя всего ей отдаете, а она даже салат порезать не может, почему вы тогда с ней гуляете? Вы не получаете то, что вам нужно, так куда вы денете свою потребность? Это не шутки. Родителей мы не выбираем, а партнеров вольны менять.\n" +
            "\n" +
            "Вы можете встретиться с девушкой и сказать: «Я хочу, чтобы потом ты мне сделала салат». Она ответит: «А я думала, секс». И если ваши ожидания и потребности не сходятся, можно перестать с этой девушкой гулять.\n" +
            "\n" +
            "Вы должны понять важную вещь: мы все придумываем причину, по которой обижаемся, жалеем себя или испытываем чувство несправедливости. Дело не в девушке. Это чувство селится в раннем детстве, а девушка нужна, чтобы оно вылезло наружу.\n" +
            "\n" +
            "У нас есть потребность в этих переживаниях. Я сам был таким. Есть такое понятие в психиатрии «психологизация проблемы». Например, человек бухает. На вопрос «Почему» он отвечает: «У меня друг умер». Вопрос: все, у кого друзья умирают, бухать начинают? Нет. А казалось бы, причина достойная. Вам кажется, что у вас чувство несправедливости из-за того, что вы отдаете себя полностью, а ей сложно даже порезать салат, но на самом деле это не так.\n" +
            "\n" +
            "Например, я не умею водить машину, за мной часто заезжали друзья. Но когда они этого не делали, я обижался. Потом я вылечился и понял, что они мне ничего не должны. Возможность обидеться можно найти везде – я мог даже не разговаривать с человеком, если он отказывался меня куда-то отвезти. Поэтому мой совет, если вам не нравится что-то, вы говорите: «Если это повторится, я уйду». И если проблема не решается, то заканчиваете отношения.\n" +
            "\n" +
            "Об обидах на партнера за измены\n" +
            "Кто заставляет людей оставаться вместе? У нас часто бывает, как в анекдоте. Пара 90 лет приходит в ЗАГС разводиться, а им говорят: «А чего вы сейчас пришли? Вы бы 40 лет назад развелись». Отвечают: «Да детей было жалко. Ждали, когда умрут».\n" +
            "\n" +
            "Как жить в ладу с собой без обиды? Взять на себя ответственность и сказать: «Это мой выбор. Я знала, что мой муж мне изменяет. Но, так как страх остаться одной пересиливал, здесь нет виноватых. Он изменил, я узнала. А вот что дальше с этим делать — это уже мой выбор». Не нужно ни на кого обижаться, нужно решать проблему страха одиночества.\n" +
            "\n" +
            "Одиночество — это не телефон, который молчит, а отсутствие интереса к самому себе. Если ребенок не умеет сам себя развлекать, нужно его развивать, чтобы в старости он не сказал: «Я боюсь остаться один». Этот страх связан только с тем, что человеку скучно с собой.\n";

    static final String  ARTICLE_SECOND = "Как справляться с обидой\n" +
            "Надо уметь договариваться с собой. Кому-то на это может понадобиться больше времени, кому-то меньше – зависит от эмоциональности. Но если вы не можете справиться с обидой очень долго, то обязательно нужно идти к психологу.\n" +
            "\n" +
            "Также нужно уметь брать на себя ответственность: например, признать, что продолжать общаться с человеком, который обижает – это только твой выбор. Если это принять, отпустит гораздо быстрее.\n" +
            "\n" +
            "Я приведу в пример историю, которую рассказывал Армен Джигарханян: «Я сижу в ресторане с другом, вором. У него на улице 26 человек охраны. А в соседнем зале кто-то играет свадьбу. И вот к моему другу подходят какие-то пьяные мужики и говорят: «Слушайте, вы бы ушли. Вы нам всю свадьбу портите, от вас просто нафталином пахнет и могилой». Я уже под стол залез, думал, сейчас всех перестреляют. А тот сказал: “Армен, пойдем отсюда. Не будем молодым мешать”». Сильные люди с высокой самооценкой не обижаются.\n" +
            "\n" +
            "У меня не очень высокая самооценка, я не люблю читать неприятные вещи про себя. Но пишут же! Что я делал? Когда я работал на «Эхо Москвы», я вслух читал все злые комментарии. Надо учиться не реагировать, с этим можно работать.\n" +
            "\n" +
            "Нужно переставать искать повод обидеться. Я однажды раз сидел в ресторане с дочерью, официанта нет 10 минут, я начинаю орать. Дочь мне говорит: «Пап, он не пытается навредить тебе, жизнь не крутится вокруг тебя. Он просто плохо работает. Ничего личного».\n"+
            "\n" + "Автор статьи Михаил Лабковский";
}
